Revit 2020 API
PathOfTravelCalculationStatus Enumeration
 An enumerated type containing possible results of the Path of Travel calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Since: 2020
Syntax
C#
public enum PathOfTravelCalculationStatus
Visual Basic
Public Enumeration PathOfTravelCalculationStatus
Visual C++
public enum class PathOfTravelCalculationStatus
Members
Member name | Description
Success |  A valid path of travel between the two points was found. Use [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] to retrieve the calculated points of path of travel.
NoPathOfTravel |  There is no valid path between the two points.
AreaTooLarge |  The view outline is too large. Calculation of the path of travel cannot be performed.
SplitView |  The view is split. Calculation of the path of travel cannot be performed.
ResultAffectedByCrop |  The view has an active crop region set. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains no points, no path of travel was found inside the crop region, but a valid path may exist outside of it. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains valid points, a path of travel was found inside the crop region, but a better option may exist outside of it.
StartAndEndPointsTooClose |  Distance between start and end points of path of travel is less than short curve tolerance.
PointOutsideActiveCrop |  Start or end point is outside the active view crop.
TooMuchGeometry |  The view is exporting too much geometry. Calculation of the path of travel cannot be performed.
See Also
Autodesk.Revit.DB.Analysis Namespace